app/Controllers/incidentController.php

    public function envoyerReponse($id)
    {
        $reponseModel = new \App\Models\ReponseModel();
        $reponse = $this->request->getPost('reponse');

        // Vérifier si la réponse est vide
        if (empty($reponse)) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Le champ réponse est obligatoire.'
            ]);
        }

        // Optionnel : vérifier que l'incident existe
        $incidentModel = new \App\Models\IncidentModel();
        $incident = $incidentModel->find($id);
---
SELECT *
FROM `incidents`
WHERE `incidents`.`id` = '14'

        ];

        // Tenter d'insérer la réponse dans la base de données
        if ($reponseModel->insert($data)) {
---
INSERT INTO `reponse` (`incident_id`, `message`, `user_id`, `created_at`, `updated_at`) VALUES ('14', 'Votre incident est résolu, merci.', '46', '2024-12-09 21:55:51', '2024-12-09 21:55:51')

 public function notifications()
{
    // Vérifiez si l'utilisateur est connecté
    if (!session()->has('user_id')) {
        return redirect()->to(base_url('login')); // Rediriger vers la page de connexion si non connecté
    }

    // Récupérer l'ID de l'utilisateur connecté
    $user_id = session()->get('user_id');

    // Récupérer les réponses associées à cet utilisateur
    $reponseModel = new ReponseModel();
    $reponses = $reponseModel->where('user_id', $user_id)->findAll();
---
SELECT *
FROM `reponse`
WHERE `user_id` = '46'